app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2016-07-07 13:33:39.876799"], ["updated_at", "2016-07-07 13:33:39.876799"]]
---
  def create
    @student=Student.new
    @student.first_name=params[:student].values[0]
    @student.last_name=params[:student].values[1]
    @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2016-07-07 13:33:40.245693"], ["id", 1]]
---
  def update
     @student = Student.find(params[:id])
     @student.update(first_name: params[:student].values[0], last_name: params[:student].values[1])